#Зад. 18 2016-SE-03 В текущата директория има само обикновени файлове (без директории). 
#Да се напише bash script, който приема 2 позиционни параметъра – числа, който мести файловете от текущата директория 
#към нови директории (a, b и c, които трябва да бъдат създадени), като определен файл се мести към директория ’a’, 
#само ако той има по-малко редове от първи позиционен параметър, мести към директория ’b’, 
#ако редове са между първи и втори позиционен параметър и в ’c’ в останалите случаи

#!/bin/bash

if [[ $# -ne 2 ]]; then
	echo "wrong input"
	exit 1
fi

if ! [[ "$1" =~ ^[0-9]+$ ]] || ! [[ "$2" =~ ^[0-9]+$ ]]; then
	echo "not numbers"
	exit 2
fi

mkdir a
mkdir b
mkdir c

for file in $(find . -type f); do
	count=$(wc -l "$file")
	if [[ ${count} -lt ${1} ]]; then
		#mv $file a
		cp $file a
	elif [[ ${count} -gt ${1} ]] && [[ ${count} -lt ${2} ]]; then
		#mv $file b
		cp $file b
	else
		#mv $file c
		cp  $file c
	fi
done
