#Зад. 24 2017-SE-01 Напишете скрипт, който получава задължителен първи позиционен параметър – директория и незадължителен втори – число. 
#Скриптът трябва да проверява подадената директория и нейните под-директории и да извежда имената на:
#а) при подаден на скрипта втори параметър – всички файлове с брой hardlink-ове поне равен на параметъра;
#б) при липса на втори параметър – всички symlink-ове с несъществуващ destination (счупени symlink-ове).
#Забележка:За удобство приемаме, че ако има подаден втори параметър, то той е число.

#!/bin/bash

if [[ $# -gt 2 ]] || [[ $# -eq 0 ]]; then
	echo "wrong input"
	exit 1
fi

if [[ ! -d "$1" ]]; then
	echo "not a dir"
	exit 2
fi

dir=$1

if [[ $# -eq 2 ]]; then
	
	if ! [[ "$2" =~ ^[0-9]+$ ]]; then
		echo "not a num"
		exit 3
	fi
	
	num=$2

	find "$dir" -type f -printf '%n %f\n' | awk '$1 >= $num {print $2}'
else
	find -L "$dir" -type l
fi

