#Зад. 28 2017-SE-05 Напишете скрипт, който получава два задължителни позиционни параметъра – директория и низ.
#Сред файловете в директорията би могло да има такива, чиито имена имат структура vmlinuz-x.y.z-arch където:
#• vmlinuz е константен низ;
#• тиретата “-” и точките “.” присъстват задължително;
#• x е число, version;
#• y е число, major revision;
#• z е число, minor revision;
#• наредената тройка x.y.z формира глобалната версия на ядрото;
#• arch е низ, архитектура (платформа) за която е съответното ядро.
#Скриптът трябва да извежда само името на файла, намиращ се в подадената директория (но не и нейните поддиректории), който:
#• спазва гореописаната структура;
#• е от съответната архитектура спрямо параметъра-низ, подаден на скрипта;
#• има най-голяма глобална версия.
#Пример:
#• Съдържание на ./kern/:
#vmlinuz-3.4.113-amd64
#vmlinuz-4.11.12-amd64
#vmlinuz-4.12.4-amd64
#vmlinuz-4.19.1-i386
#• Извикване и изход:
#$ ./task1.sh ./kern/ amd64
#vmlinuz-4.12.4-amd64

#!/bin/bash

if [[ $# -ne 2 ]]; then
	echo "wrong input"
	exit 1
fi

if [[ ! -d $1 ]]; then
	echo "not a dir"
	exit 2
fi

#if ! [[ "$2" =~ ^[a-zA-Z]+$ ]]; then .. 
	
dir=$1
str=$2

find $dir -maxdepth 1 -type f -printf "%f\n" | egrep "vmlinuz-([0-9]+.){2}[0-9]+-$str" | sort -n -t'.' -k2,2 | tail -n 1
#find $dir -maxdepth 1 -type f -regextype egrep -regex "vmlinuz-([0-9]+.){2}[0-9]+-$str" | sort -V | tail -n 1