#Зад. 30 2018-SE-01 Нека съществува програма за моментна комуникация (Instant messaging), която записва логове на разговорите в следния формат:
#• има определена директория за логове (LOGDIR)
#• в нея има директорийна структура от следния вид:
#LOGDIR/протокол/акаунт/приятел/ като на всяко ниво може да има няколко екземпляра от съответния вид,  
#т.е. няколко директории протокол, във всяка от тях може да има няколко директории акаунт, и във всяка от тях – няколко директории приятел
#• във всяка от директориите приятел може да има файлове с имена от вида yyyy-mm-dd-hh-mm-ss.txt
#– година-месец-ден и т.н., спрямо това кога е започнал даден разговор
#• всеки такъв файл представлява лог на даден разговор със съответния приятел, като всякаразменена реплика между вас е на отделен ред
#• даден идентификатор приятел може да се среща няколко пъти в структурата (напр. през различни ваши акаунти сте водили разговори със същия приятел)
#Напишете скрипт, който приема задължителен позиционен аргумент - име на лог директория (LOGDIR). 
#Скриптът трябва да извежда десетимата приятели, с които имате най-много редове комуникация глобално 
#(без значение протокол и акаунт), и колко реда имате с всеки от тях. 
#Опишете в коментар как работи алгоритъмът ви.

#!/bin/bash

if [[ $# -ne 1 ]]; then
	echo "wrong input"
	exit 1
fi

if ! [[ "$1" =~ ^[0-9]{4}\-[0-9]{2}\-[0-9]{2}\-[0-9]{2}\-[0-9]{2}\-[0-9]{2}\.txt$ ]]; then
	echo "wrong format"
	exit 2
fi

dir=$1

T=$(mktemp)

for friend in $(find "${dir}" -mindepth 3 -type d -printf '%f\n' | sort | uniq); do
	count=$(find "${dir}" -mindepth 4 -maxdepth 4 -type f 2>dev/null | egrep ".*/${friend}/[0-9]+-[0-9]+-[0-9]+-[0-9]+-[0-9]+-[0-9]+\.txt" | xargs cat | wc -l)
	echo "$count ${friend}" | cat >> ${T}
done

cat ${T} | sort -rn | head

rm ${T}
