#Зад. 45 2021-SE-04 Разполагате с машина, на която е инсталиран специализиран софтуер, който ползва два потребителски акаунта – oracle и grid. 
#За всеки от двата акаунта съществува директория, която ще наричаме diag_dest и тя е от вида /u01/app/потребител.
#Всеки от потребителите би трябвало да има environment променлива ORACLE_HOME, която указва абсолютен път до директория във формат /път/до/дир. 
#В поддиректорията bin на зададената директория би трябвало да има изпълним файл с име adrci.
#Всеки от потребителите може да подаде серия от подкоманди, които неговото копие на adrci да изпълни, като го извика с параметър exec="cmd1; cmd2; cmd3". 
#Отделните подкоманди се разделят с точка и запетая (;). Командата adrci винаги приключва с exit code 0. Нека дефинираме следните подкоманди:
#• SET BASE – за да се гарантира правилна работа на командата adrci, при всяко нейно извикване първата подкоманда трябва да бъде от вида SET BASE diag_dest, 
#където diag_dest е абсолютният път на съответната директория за дадения потребител
#• SHOW HOMES – подкоманда SHOW HOMES извежда на STDOUT един от следните два изхода:
#– вариант 1: (неуспех): No ADR homes are set
#– вариант 2: (успех):
#ADR Homes:
#diag/rdbms/orclbi/orclbi1
#diag/rdbms/orclbi/orclbi2
#Ако командата се изпълни успешно, тя връща списък с един или повече ADR Homes, които са релативни имена на директории спрямо diag_dest на съответният потребител.
#От полученият списък с релативни пътища интересни за нас са само тези, които за име на директория на второ ниво имат една от следните директории: 
#crs, tnslsnr, kfod, asm или rdbms.
#• SET HOMEPATH – подкоманда SET HOMEPATH път задава активна работна директория, спрямо която ще се изпълняват последващи подкоманди в рамките на същото изпълнение на adrci;
#път е релативен път до директория, спрямо изхода на SHOW HOMES
#• PURGE – подкоманда PURGE -AGE минути изтрива определени файлове в текущо активната работна директория, по-стари от дефинираното време в минути. 
#Забележка: изтриват се само безопасни файлове, т.е. такива, чието изтриване няма да доведе до проблем. Дефиницията на безопасни файлове е извън обхвата на тази задача.
#Напишете shell скрипт, който може да се изпълнява само от някой от указаните два акаунта и приема задължителен първи позиционен аргумент число (в часове, минимална стойност 2 часа).
#Скриптът трябва да почиства безопасните файлове по-стари от зададените часове в интересните ADR Home-ове на съответния потребител.

#!/bin/bash

if [[ "$(whoami)" != "oracle" ]] && [[ "$(whoami)" != "grid" ]]; then
	echo "not a valid account"
	exit 1
fi

if ! [[ "${1}" =~ ^[0-9]+$ ]] && [[ "${1}" -lt 2 ]]; then
	echo "not a num"
	exit 2
fi

#export ORACLE_HOME=/path/to/dir
diag_dest="/u01/app/$(whoami)"

ADR=$($ORACLE_HOME/bin/adrci exec="SET BASE ${diag_dest}; SHOW HOMES")

if ! echo "${ADR}" | grep -q "^ADR Homes:"; then
	exit 0
fi

while read line;do
	dir=$(echo ${line} | cut -d '/' -f2)
    if [[ ${dir} == "crs" || ${dir} == "tnslsnr" || ${dir} == "kfod" || ${dir} == "asm" || ${dir} == "rdbms" ]]; then
        $ORACLE_HOME/bin/adrci exec="SET BASE ${diag_dest}; SET HOMEPATH ${line}; PURGE -AGE $(($1*60))" 
    fi

done < <(echo "$ADR" | tail -n +2)