#4600 - Да се напише shell скрипт, който валидира дали дадено цяло число попада в целочислен интервал.
#Скриптът приема 3 аргумента: числото, което трябва да се провери; лява граница на интервала; дясна граница на интервала.
#Скриптът да връща exit status:
#- 3, когато поне един от трите аргумента не е цяло число
#- 2, когато границите на интервала са обърнати
#- 1, когато числото не попада в интервала
#- 0, когато числото попада в интервала

#Примери:
#$ ./validint.sh -42 0 102; echo $?
#1 

#$ ./validint.sh 88 94 280; echo $?
#1 

#$ ./validint.sh 32 42 0; echo $?
#2

#$ ./validint.sh asdf - 280; echo $?
#3

#!/bin/bash

if [[ $# -ne 3 ]]; then
    echo "Wrong input"
    exit 4
fi

num=$1
left=$2
right=$3

if ! [[ ${num} =~ ^-?[0-9]+$ ]] || ! [[ ${left} =~ ^-?[0-9]+$ ]] || ! [[ ${right} =~ ^-?[0-9]+$ ]]; then
    exit 3
fi

if [[ ${left} -gt ${right} ]]; then
    exit 2
fi

if [[ ${num} -lt ${left} ]] || [[ ${num} -gt ${right} ]]; then
    exit 1
else
    exit 0
fi