#4700 - Да се напише shell скрипт, който форматира големи числа, за да са по-лесни за четене.
#Като пръв аргумент на скрипта се подава цяло число.
#Като втори незадължителен аргумент се подава разделител. По подразбиране цифрите се разделят с празен интервал.

#Примери:
#$ ./nicenumber.sh 1889734853
#1 889 734 853

#$ ./nicenumber.sh 7632223 ,
#7,632,223

#!/bin/bash

if [[ $# -gt 2 ]] || [[ $# -eq 0 ]]; then
	echo "wrong input"
	exit 1
fi

if [[ -z "$1" ]] || ! [[ "$1" =~ ^[0-9]+$ ]]; then
    echo "not a number"
    exit 2
fi

sep=${2:-" "}

nice_num=$(echo $1 | rev | sed 's/\([0-9]\{3\}\)/\1'"$sep"'/g' | rev)

if [[ "$nice_num" =~ $sep$ ]]; then
    nice_num=${nice_num%$sep}
fi

echo "$nice_num"
