#4800 - Да се напише shell скрипт, който приема файл и директория. Скриптът проверява в подадената 
#директория и нейните под-директории дали съществува копие на подадения файл и отпечатва имената на 
#намерените копия, ако съществуват такива.

#NB! Под 'копие' разбираме файл със същото съдържание.

#!/bin/bash

if [[ $# -ne 2 ]]; then
	echo "Wrong input"
	exit 1
fi

if [[ ! -f $1 ]]; then
	echo "not a file"
	exit 2 
fi

if [[ ! -d $2 ]]; then
	echo "not a dir"
	exit 3
fi

file=$1
dir=$2

find "$dir" -type f -exec cmp -s "$file" {} \; -print